<a href="https://colab.research.google.com/github/muhammadaskar/DATA-MINING/blob/main/naiveBayesDataKontinyu.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd

In [12]:
# KETERANGAN

# suka musik 
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka membaca
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka olahraga
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# senang diskusi
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka menggambar
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# suka menari
#  1 = tidak suka
#  2 = suka
#  3 = kadang - kadang

# gaya belajar
#  1 = Auditori
#  2 = Visual
#  3 = Kinestetik

In [17]:
dt = pd.read_excel("/content/sample_data/data testing.xls")
dt.head()

  Jenis Kelamin  suka musik  ...  Suka Menari  Gaya Belajar
0     Laki-laki           2  ...            1             1
1     Perempuan           1  ...            1             2
2     Perempuan           1  ...            2             3
3     Laki-laki           3  ...            2             3
4     Laki-laki           1  ...            1             2

[5 rows x 8 columns]

In [18]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Jenis Kelamin    15 non-null     object
 1   suka musik       15 non-null     int64
 2   Suka Membaca     15 non-null     int64
 3   Suka Olahraga    15 non-null     int64
 4   Senang Diskusi   15 non-null     int64
 5   Suka Menggambar  15 non-null     int64
 6   Suka Menari      15 non-null     int64
 7   Gaya Belajar     15 non-null     int64
dtypes: int64(7), object(1)
memory usage: 1.1+ KB

In [19]:
x = dt.drop(["Jenis Kelamin"], axis=1)
x.head(15)

    suka musik  Suka Membaca  ...  Suka Menari  Gaya Belajar
0            2             1  ...            1             1
1            1             2  ...            1             2
2            1             1  ...            2             3
3            3             2  ...            2             3
4            1             2  ...            1             2
5            1             1  ...            2             3
6            2             3  ...            1             1
7            3             3  ...            2             2
8            3             2  ...            1             1
9            1             2  ...            1             2
10           2             3  ...            1             2
11           2             1  ...            1             1
12           2             1  ...            1             1
13           2             2  ...            3             1
14           1             1  ...            1             3

[15 rows x 7 columns]

In [38]:
y = dt["Gaya Belajar"]
y.head(15)

0     1
1     2
2     3
3     3
4     2
5     3
6     1
7     2
8     1
9     2
10    2
11    1
12    1
13    1
14    3
Name: Gaya Belajar, dtype: int64

In [22]:
from sklearn.model_selection import train_test_split
# Import Gaussian Naive Bayes model
from sklearn.naive_bayes import GaussianNB
# Mengaktifkan/memanggil/membuat fungsi klasifikasi Naive bayes
modelnb = GaussianNB()
# Memasukkan data training pada fungsi klasifikasi naive bayes
nbtrain = modelnb.fit(x, y)
datauji = pd.read_excel("/content/sample_data/data uji.xls")
datauji.head(5)

  Jenis Kelamin  suka musik  ...  Suka Menari  Gaya Belajar
0     perempuan           2  ...            1             3
1     laki-laki           1  ...            1             3
2     perempuan           2  ...            3             2
3     laki-laki           1  ...            1             1
4     perempuan           2  ...            1             2

[5 rows x 8 columns]

**I am dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female**

In [25]:
x_test = datauji.drop(["Jenis Kelamin"], axis=1)
x_test.head(5)

   suka musik  Suka Membaca  ...  Suka Menari  Gaya Belajar
0           2             3  ...            1             3
1           1             1  ...            1             3
2           2             2  ...            3             2
3           1             3  ...            1             1
4           2             1  ...            1             2

[5 rows x 7 columns]

In [26]:
y_uji = datauji["Gaya Belajar"]
y_uji.head(5)

0    3
1    3
2    2
3    1
4    2
Name: Gaya Belajar, dtype: int64

In [27]:
Y_predict = nbtrain.predict(x_test)
print("Prediksi Naive Bayes : ",Y_predict)

Prediksi Naive Bayes :  [2 2 2 1 2]

In [28]:
from sklearn.metrics import accuracy_score
accuracy= accuracy_score(y_uji, Y_predict)
print("Akurasi Naive Bayes : ",accuracy)

Akurasi Naive Bayes :  0.6

In [40]:
from sklearn.model_selection import cross_val_score
scores = cross_val_score(modelnb, x, y, cv=4)
scores.mean()

0.7083333333333334